-- 创建学生数据库
CREATE DATABASE student_db
DEFAULT CHARACTER SET utf8mb4;


/*
学生表包含：
1. 学生ID
2. 学生姓名
3. 身高
*/
CREATE TABLE students (
    student_id INT PRIMARY KEY AUTO_INCREMENT,
    student_name VARCHAR(50),
    height DECIMAL(5,2)
);


-- 插入50个学生数据
INSERT INTO students
(student_name, height)
VALUES
('张伟',175.2),
('李娜',162.8),
('王强',180.1),
('刘洋',172.3),
('陈静',160.5),
('杨磊',178.6),
('赵敏',165.4),
('黄涛',182.0),
('周婷',158.7),
('吴鹏',177.2),
('徐丽',163.5),
('孙浩',181.4),
('胡雪',167.1),
('朱凯',174.8),
('高媛',159.9),
('林超',183.2),
('何倩',161.0),
('郭飞',176.5),
('马丽',164.3),
('罗杰',179.6),
('梁雪',166.8),
('宋涛',171.9),
('郑佳',157.6),
('谢峰',184.0),
('韩梅',162.2),
('唐龙',185.5),
('冯婷',168.9),
('于洋',173.7),
('董洁',160.1),
('萧宇',178.2),
('程丽',164.9),
('曹凯',181.8),
('袁梦',158.4),
('邓杰',176.9),
('许静',165.8),
('傅超',182.6),
('沈娜',163.2),
('曾磊',177.5),
('彭佳',159.3),
('吕晨',174.1),
('苏敏',161.7),
('卢涛',180.7),
('蒋婷',166.0),
('蔡宇',172.6),
('丁洁',157.9),
('魏峰',186.1),
('叶静',164.7),
('潘超',178.9),
('杜雪',162.5),
('余浩',183.8);


SELECT *
FROM students;

-- 查询身高超过180的学生：
SELECT *
From students 
Where height > 180 ;

-- 按身高从高到低排序：
Select  *
from students 
Order by height DESC;

-- 查看平均身高
Select AVG(height)
FROM students